<?php
/**
 * メッセージ定義
 */

return array(
	/**
	 * -------------------------------------------------------------------------
	 *  共通メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_CI0001' => 'パスワード有効期限が切れています。パスワードを変更してください。',
	'm_CI0002' => 'パスワードが変更されました。',
	'm_CI0003' => '検索結果が０件でした。',
	'm_CI0004' => '出力対象が０件でした。',
	'm_CI0005' => '入力内容をクリアしますか？',
	'm_CI0006' => 'ユーザがログインしました。',
	'm_CI0007' => '指定された期間にてデータを削除しますか？',
	'm_CI0008' => 'データの削除が完了しました。',
	'm_CI0009' => '選択されたユーザーデータ（XXXXX）を削除しますか？',
	'm_CW0001' => '【CW0001】ユーザIDもしくはパスワードが誤っています。',
	'm_CW0002' => '【CW0002】このユーザは現在ロックされています。',
	'm_CW0003' => '【CW0003】現在のパスワードが誤っています。',
	'm_CW0004' => '【CW0004】新しいパスワードとパスワード確認入力は同じ値を入力してください。',
	'm_CW0005' => '【CW0005】未入力の入力項目があります（項目：XXXXX）',
	'm_CW0006' => '【CW0006】入力内容に誤りがあります（項目：XXXXX）',
	'm_CW0007' => '【CW0007】XXXXXの指定範囲が不正です。',
	'm_CW0008' => '【CW0008】登録するレコードがありません。',
	'm_CW0009' => '【CW0009】既に登録されているレコードです。',
	'm_CW0010' => '【CW0010】更新対象レコードは存在しません。',
	'm_CW0011' => '【CW0011】削除基準日付には１０年以上過去の日付を指定してください。',
    'm_CW0012' => '【CW0012】入力されたXXXXXはxxxxxに存在しません。',
    'm_CW0013' => '【CW0013】XXXXXは、数値で入力して下さい。',
    'm_CW0014' => '【CW0014】XXXXXは、xxxxx文字以下で入力して下さい。',
    'm_CW0015' => '【CW0015】XXXXXが選択されていません。',
    'm_CW0016' => '【CW0016】XXXXXは、xxxxx文字以上で入力して下さい。',
    'm_CW0017' => '【CW0017】XXXXXは、半角カタカナで入力して下さい。',
    'm_CW0018' => '【CW0018】XXXXXは、日付で入力して下さい。',
    'm_CW0019' => '【CW0019】XXXXXをアップロードしてください。',
    'm_CW0020' => '【CW0020】見出し行が不正です。最新の雛形ファイルをご利用ください。',
    'm_CW0021' => '【CW0021】得意先が存在しないため処理を中断しました。',
    'm_CW0022' => '【CW0022】XXXXXは、xxxxxを入力して下さい。',
    'm_CW0023' => '【CW0023】XXXXXは、正しいメールアドレスで入力して下さい。',
    'm_CW0024' => '【CW0024】XXXXXは、すでに存在しています。',
    'm_CW0025' => '【CW0025】未選択の項目があります（項目：XXXXX）',
    'm_CW0026' => '【CW0026】XXXXXは、正しい郵便番号で入力して下さい。',
    'm_CW0027' => '【CW0027】XXXXXは、正しい番号で入力して下さい。',
    'm_CW0028' => '【CW0028】XXXXXは、存在していません。',
	'm_CE0001' => '【CE0001】予期せぬエラーが発生しました。',
	'm_CE0002' => '【CE0002】DB接続エラーが発生しました。',
	'm_CE0003' => '【CE0003】不要な帳票ファイルの削除に失敗しました。',
	'm_CE0004' => '【CE0004】帳票出力先ディレクトリの作成に失敗しました。',
	'm_CE0005' => '【CE0005】不要な入力ファイルの削除に失敗しました。',
	'm_CE0006' => '【CE0006】アップロード用ディレクトリの作成に失敗しました。',
    'm_CE0007' => '【CE0007】操作ログの出力に失敗しました。',
    'm_CE0008' => '【CE0008】データの削除に失敗しました。',
    'm_CE0009' => '【CE0009】アップロードに失敗しました。',
    'm_CE0010' => '【CE0010】アップロードデータのフォーマットが正しくありません。',
    'm_CE0011' => '【CE0011】アップロードデータがありません。',

	/**
	 * -------------------------------------------------------------------------
	 *  会社情報メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_CO0001' => '会社情報を登録しますか？',
	'm_CO0002' => '会社情報を更新しますか？',
	'm_CO0003' => '会社情報を削除しますか？',
	'm_CO0004' => '会社情報登録が正常に完了しました。',
	'm_CO0005' => '会社情報更新が正常に完了しました。',
	'm_CO0006' => '会社情報削除が正常に完了しました。',
	'm_CO0007' => '会社情報登録に失敗しました。',
	'm_CO0008' => '会社情報更新に失敗しました。',
	'm_CO0009' => '会社情報削除に失敗しました。',

	/**
	 * -------------------------------------------------------------------------
	 *  お客様情報メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_CUS001' => 'お客様データを登録しますか？',
	'm_CUS002' => 'お客様データを更新しますか？',
	'm_CUS003' => 'お客様データを削除しますか？',
	'm_CUS004' => 'お客様データ登録は正常に完了しました。',
	'm_CUS005' => 'お客様データ更新は正常に完了しました。',
	'm_CUS006' => '選択されたお客様データ（XXXXX）を削除しますか？',
	'm_CUS007' => 'お客様データ削除は正常に完了しました。',
	'm_CUS008' => '【CUS008】お客様データ登録に失敗しました。',
	'm_CUS009' => '【CUS009】お客様データ更新に失敗しました。',
	'm_CUS010' => '【CUS010】お客様データ削除に失敗しました。',
	'm_CUS011' => '【CUS011】選択されたお客様データは存在しません。',
	'm_CUS012' => '【CUS012】お客様データが存在しないか紐づいていません。',

	/**
	 * -------------------------------------------------------------------------
	 *  車両情報メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_CAR001' => '車両データを登録しますか？',
	'm_CAR002' => '車両データを更新しますか？',
	'm_CAR003' => '車両データを削除しますか？',
	'm_CAR004' => '車両データ登録は正常に完了しました。',
	'm_CAR005' => '車両データ更新は正常に完了しました。',
	'm_CAR006' => '車両データ削除は正常に完了しました。',
	'm_CAR007' => '選択された車両データ（XXXXX）を削除しますか？',
	'm_CAR008' => '【CAR008】車両データ登録に失敗しました。',
	'm_CAR009' => '【CAR009】車両データ更新に失敗しました。',
	'm_CAR010' => '【CAR010】車両データ削除に失敗しました。',
	'm_CAR011' => '【CAR011】選択された車両データは存在しません。',

    /**
	 * -------------------------------------------------------------------------
	 *  予約スケジュールメッセージ
	 * -------------------------------------------------------------------------
	 */
    'm_SC0001' => '予約データを登録しますか？',
    'm_SC0002' => '予約データを更新しますか？',
    'm_SC0003' => '予約データを削除しますか？',
    'm_SC0004' => '予約データを一括登録しますか？',
    'm_SC0005' => '予約データ登録は正常に完了しました。',
    'm_SC0006' => '予約データ更新は正常に完了しました。',
    'm_SC0007' => '予約データ削除は正常に完了しました。',
    'm_SC0008' => '予約データ一括登録は正常に完了しました。',
    'm_SC0009' => '予約一覧表出力は正常に完了しました。',
    'm_SC0010' => '入力された内容で予約スケジュールを更新しますか？',
    'm_SC0011' => '【SC0011】登録対象の予約データは存在しません。',
    'm_SC0012' => '【SC0012】選択された予約データは存在しません。',
    'm_SC0013' => '【エラー】XXXXXを入力して下さい。',
    'm_SC0014' => '【エラー】XXXXXは、xxxxx文字以上で入力して下さい。',
    'm_SC0015' => '【エラー】XXXXXは、xxxxx文字以下で入力して下さい。',
    'm_SC0016' => '【エラー】XXXXXは、日付を入力して下さい。',
    'm_SC0017' => '【エラー】XXXXXは、数値を入力して下さい。',
    'm_SC0018' => '【エラー】XXXXXは、xxxxxを入力して下さい。',
    'm_SC0019' => '【エラー】予約データ登録に失敗しました。',
    'm_SC0020' => '【SC0020】出力対象予約レコードが選択されていません。',
    'm_SC0021' => '【エラー】入力された予約番号の予約データは既に登録されています。',
    'm_SC0022' => '【エラー】入力された予約番号の予約データは存在しません。',
    'm_SC0023' => '【SC0023】出力対象予約レコードがありません。',
    'm_SC0024' => '【SC0024】削除する予約データを選択してください。',
    'm_SC0025' => '【SC0025】予約データ登録に失敗しました。',
    'm_SC0026' => '【SC0026】予約データ更新に失敗しました。',
    'm_SC0027' => '【SC0027】予約データ削除に失敗しました。',
    'm_SC0028' => '【SC0028】予約データ日時変更に失敗しました。',
    'm_SC0029' => '【SC0029】予約データが存在しません。',
    'm_SC0030' => '【SC0030】予約データをキャンセルしました。',
    'm_SC0031' => '【SC0031】予約データキャンセルに失敗しました。',
    'm_SC0032' => '【SC0032】予約データを完了しました。',
    'm_SC0033' => '【SC0033】予約データ完了に失敗しました。',

	/**
	 * -------------------------------------------------------------------------
	 *  入出庫メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_LO0001' => '入出庫データを登録しますか？',
	'm_LO0002' => '入出庫データを更新しますか？',
	'm_LO0003' => '入出庫データを削除しますか？',
	'm_LO0004' => '入出庫データ登録は正常に完了しました。',
	'm_LO0005' => '入出庫データ更新は正常に完了しました。',
	'm_LO0006' => '入出庫データ削除は正常に完了しました。',
	'm_LO0007' => '選択された入出庫データ（XXXXX）を削除しますか？',
    'm_LO0008' => '入出庫一覧表出力は正常に完了しました。',
	'm_LO0009' => '入庫シールを印刷しますか？',
    'm_LE0001' => '【LE0001】入出庫データ登録に失敗しました。',
    'm_LE0002' => '【LE0002】入出庫データ更新に失敗しました。',
    'm_LE0003' => '【LE0003】入出庫データ削除に失敗しました。',

	/**
	 * -------------------------------------------------------------------------
	 *  入庫メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_RE0001' => '入庫データを登録しますか？',
	'm_RE0002' => '入庫データを更新しますか？',
	'm_RE0003' => '入庫データを削除しますか？',
	'm_RE0004' => '入庫データ登録は正常に完了しました。',
	'm_RE0005' => '入庫データ更新は正常に完了しました。',
	'm_RE0006' => '入庫データ削除は正常に完了しました。',
	'm_RE0007' => '選択された入庫データ（XXXXX）を削除しますか？',
    'm_RE0008' => '入庫シール印刷は正常に完了しました。',
    'm_RE0009' => '【RE0009】入庫データ登録に失敗しました。',
    'm_RE0010' => '【RE0010】入庫データ更新に失敗しました。',
    'm_RE0011' => '【RE0011】入庫データ削除に失敗しました。',
    'm_RE0012' => '【RE0012】入庫時の車両情報更新に失敗しました。',
    'm_RE0013' => '入庫シール印刷を行いますか？',

	/**
	 * -------------------------------------------------------------------------
	 *  出庫メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_DE0001' => '出庫データを登録しますか？',
	'm_DE0002' => '出庫データを更新しますか？',
	'm_DE0003' => '出庫データを削除しますか？',
	'm_DE0004' => '出庫データ登録は正常に完了しました。',
	'm_DE0005' => '出庫データ更新は正常に完了しました。',
	'm_DE0006' => '出庫データ削除は正常に完了しました。',
	'm_DE0007' => '選択された出庫データを確定しますか？',
	'm_DE0008' => '選択された出庫データを削除しますか？',
    'm_DE0009' => '【DE0009】出庫データ登録に失敗しました。',
    'm_DE0010' => '【DE0010】出庫データ更新に失敗しました。',
    'm_DE0011' => '【DE0011】出庫データ削除に失敗しました。',
    'm_DE0012' => '【DE0012】出庫データが存在しません。',
	'm_DE0013' => '出庫データ確定は正常に完了しました。',

	/**
	 * -------------------------------------------------------------------------
	 *  出庫指示メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_DS0001' => '出庫指示データを登録しますか？',
	'm_DS0002' => '出庫指示データを更新しますか？',
	'm_DS0003' => '出庫指示データを削除しますか？',
	'm_DS0004' => '出庫指示データ登録は正常に完了しました。',
	'm_DS0005' => '出庫指示データ更新は正常に完了しました。',
	'm_DS0006' => '出庫指示データ削除は正常に完了しました。',
	'm_DS0007' => '選択された出庫指示データ指示を確定しますか？',
	'm_DS0008' => '選択された出庫指示データ指示を削除しますか？',
    'm_DS0009' => '【DS0009】出庫指示データ登録に失敗しました。',
    'm_DS0010' => '【DS0010】出庫指示データ更新に失敗しました。',
    'm_DS0011' => '【DS0011】出庫指示データ削除に失敗しました。',
    'm_DS0012' => '【DS0012】出庫指示データが存在しません。',
	'm_DS0013' => '出庫指示データ確定は正常に完了しました。',
	'm_DS0014' => '出庫指示データの取下は正常に完了しました。',
	'm_DS0015' => '【DS0015】出庫指示データの取下に失敗しました。',
	'm_DS0016' => '選択された出庫指示データの出庫指示書を印刷しますか？',
	'm_DS0017' => '出庫指示書印刷は正常に完了しました。',
	'm_DS0018' => '選択された出庫指示データの入庫シールを印刷しますか？',
	'm_DS0019' => '出庫指示書印刷は正常に完了しました。',

	/**
	 * -------------------------------------------------------------------------
	 *  マスタメンテナンス業務メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_MI0001' => 'マスタを登録しますか？',
	'm_MI0002' => 'マスタを更新しますか？',
	'm_MI0003' => 'マスタを削除しますか？',
	'm_MI0004' => 'CSV取込が正常に完了しました。',
	'm_MI0005' => 'マスタ登録が正常に完了しました。',
	'm_MI0006' => 'マスタ更新が正常に完了しました。',
	'm_MI0007' => 'マスタ削除が正常に完了しました。',
	'm_MI0008' => 'ユーザのロックを解除しますか？',
	'm_MI0009' => 'ユーザのロックを解除しました。',
	'm_MI0010' => 'ユーザのパスワードを初期化しますか？',
	'm_MI0011' => 'ユーザのパスワードを初期化しました。初期化後パスワードは「XXXXX」です（７日以内にパスワード変更を実施してください）',
	'm_MI0012' => '既に登録されている会社名です。このまま登録しますか？',
	'm_MI0013' => 'マスタ登録が正常に完了しました。ユーザの初期パスワードは「XXXXX」です。',
    'm_MI0014' => '選択された得意先（XXXXX）を削除しますか？',
    'm_MI0015' => '選択された保管場所（XXXXX）を削除しますか？',
    'm_MI0016' => 'マスタ更新が正常に完了しました。登録・変更したユーザの初期パスワードは「XXXXX」です。',
    'm_MI0017' => '【MI0017】ユニットマスタ一覧出力は正常に完了しました。',
    'm_MI0018' => '【MI0018】庸車先マスタ一覧出力は正常に完了しました。',
    'm_MI0019' => '【MI0019】ユーザーマスタ一覧出力は正常に完了しました。',
    'm_MI0020' => '【MI0020】車種マスタ一覧出力は正常に完了しました。',
    'm_MI0021' => '【MI0021】車両マスタ一覧出力は正常に完了しました。',
    'm_MI0022' => '選択されたユニット（XXXXX）を削除しますか？',
    'm_MI0023' => 'マスタを無効にしますか？',
    'm_MI0024' => 'マスタを有効にしますか？',
    'm_MI0025' => '【MI0025】選択された保管場所データは存在しません。',
	'm_MW0001' => '【MW0001】CSVファイルのフォーマットが不正です。（XXXXX）',
	'm_MW0002' => '【MW0002】既に登録済みのレコードがCSVファイルに含まれています。',
	'm_MW0003' => '【MW0003】選択されたレコードは存在しません。',
	'm_MW0004' => '【MW0004】入力された情報は既に登録されています。',
	'm_MW0005' => '【MW0005】更新対象レコードは存在しません。',
	'm_MW0006' => '【MW0006】存在しないレコードの更新がCSVファイルに含まれています。',
	'm_MW0007' => '【MW0007】存在しないレコードの削除がCSVファイルに含まれています。',
	'm_MW0008' => '【MW0008】入力されたXXXXXは既に登録されています。',
	'm_MW0009' => '【MW0009】XXXXXの更新対象レコードは存在しません。',
	'm_MW0010' => '【MW0010】XXXXXの削除対象レコードは存在しません。',
	'm_MW0011' => '【MW0011】修正処理にて会社の登録はできません。',
	'm_MW0012' => '【MW0012】入力されたユーザ名は既に使用されています。',
	'm_MW0013' => '【MW0013】この社員にはログインユーザ情報が登録されていません。',
    'm_MW0014' => '【MW0014】更新対象の通知データが選択されていません。検索画面にて通知データを選択してください。',
    'm_MW0015' => '【MW0015】部署を登録する場合は営業所名を入力してください。',
    'm_MW0016' => '【MW0016】既に登録されているXXXXXが入力されています。',
    'm_MW0017' => '【MW0017】入力されたXXXXXは存在しません。',
    'm_MW0018' => '【MW0018】更新対象のXXXXXは存在しません。',
    'm_MW0019' => '【MW0019】この得意先はXXXXXの変更ができません。',
    'm_MW0020' => '【MW0020】この庸車先はXXXXXの変更ができません。',
    'm_MW0021' => '【MW0021】部署は変更できません。',
    'm_MW0022' => '【MW0022】前画面にて入力された会社に所属しない営業所が入力されています。',
    'm_MW0023' => '【MW0023】保管料部署を選択してください。',
    'm_MW0024' => '【MW0024】保管料金額を入力してください。',
	'm_ME0001' => '【ME0001】ログインユーザの登録に失敗しました。（ユーザID：XXXXX）',
	'm_ME0002' => '【ME0002】ログインユーザの削除に失敗しました。（ユーザID：XXXXX）',
    'm_ME0003' => '【ME0003】マスタ登録に失敗しました。',
    'm_ME0004' => '【ME0004】マスタ更新に失敗しました。',
    'm_ME0005' => '【ME0005】マスタ削除に失敗しました。',
    'm_ME0006' => '【ME0006】XXXXXマスタ登録に失敗しました。',
    'm_ME0007' => '【ME0007】XXXXXマスタ更新に失敗しました。',
    'm_ME0008' => '【ME0008】XXXXXマスタ削除に失敗しました。',

	/**
	 * -------------------------------------------------------------------------
	 *  集計業務メッセージ
	 * -------------------------------------------------------------------------
	 */
	'm_TI0001' => '課別売上集計表出力（日単位）は正常に完了しました。',
	'm_TI0002' => '課別売上集計表出力（月単位）は正常に完了しました。',
	'm_TI0003' => '課別売上集計表出力（年単位）は正常に完了しました。',
	'm_TI0004' => '得意先別売上集計表出力（日単位）は正常に完了しました。',
	'm_TI0005' => '得意先別売上集計表出力（月単位）は正常に完了しました。',
	'm_TI0006' => '得意先別売上集計表出力（年単位）は正常に完了しました。',
	'm_TI0007' => '庸車先別売上集計表出力（日単位）は正常に完了しました。',
	'm_TI0008' => '庸車先別売上集計表出力（月単位）は正常に完了しました。',
	'm_TI0009' => '庸車先別売上集計表出力（年単位）は正常に完了しました。',
	'm_TI0010' => '車両別売上集計表出力（日単位）は正常に完了しました。',
	'm_TI0011' => '車両別売上集計表出力（月単位）は正常に完了しました。',
	'm_TI0012' => '車両別売上集計表出力（年単位）は正常に完了しました。',
	'm_TI0013' => '取扱いトン数集計表出力（日単位）は正常に完了しました。',
	'm_TI0014' => '取扱いトン数集計表出力（月単位）は正常に完了しました。',
	'm_TI0015' => '取扱いトン数集計表出力（年単位）は正常に完了しました。',
    'm_TI0016' => 'ドライバー別売上集計表出力（3課）は正常に完了しました。',
	'm_TI0017' => 'ドライバー別売上集計表出力（2課）は正常に完了しました。',
	'm_TI0018' => 'ドライバー別売上集計表出力（輸送所）は正常に完了しました。',
	'm_TI0019' => '車番案内書出力は正常に完了しました。',
	'm_TI0020' => '売上請求予定明細書出力は正常に完了しました。',
	'm_TI0021' => '傭車支払予定明細書出力は正常に完了しました。',
    'm_TI0022' => '請求明細書出力は正常に完了しました。',
    'm_TI0023' => 'ドライバー別売上集計表出力（1課）は正常に完了しました。',
	'm_TW0001' => '【TW0001】集計範囲はXXXXX以内で指定してください。',
	'm_TW0002' => '【TW0002】選択された得意先は存在しません。',
	'm_TW0003' => '【TW0003】選択された庸車先は存在しません。',
	'm_TW0004' => '【TW0004】選択された車両は存在しません。',
    'm_TW0005' => '【TW0005】XXXXXが指定されていません。',
    'm_TW0006' => '【TW0006】出力対象レコードが選択されていません。',
	'm_TE0001' => '【TE0001】課別売上集計表（日単位）テンプレートファイルが存在しません。',
	'm_TE0002' => '【TE0002】課別売上集計表（月単位）テンプレートファイルが存在しません。',
	'm_TE0003' => '【TE0003】課別売上集計表（年単位）テンプレートファイルが存在しません。',
	'm_TE0004' => '【TE0004】得意先別売上集計表（日単位）テンプレートファイルが存在しません。',
	'm_TE0005' => '【TE0005】得意先別売上集計表（月単位）テンプレートファイルが存在しません。',
	'm_TE0006' => '【TE0006】得意先別売上集計表（年単位）テンプレートファイルが存在しません。',
	'm_TE0007' => '【TE0007】庸車先別売上集計表（日単位）テンプレートファイルが存在しません。',
	'm_TE0008' => '【TE0008】庸車先別売上集計表（月単位）テンプレートファイルが存在しません。',
	'm_TE0009' => '【TE0009】庸車先別売上集計表（年単位）テンプレートファイルが存在しません。',
	'm_TE0010' => '【TE0010】車両別売上集計表（日単位）テンプレートファイルが存在しません。',
	'm_TE0011' => '【TE0011】車両別売上集計表（月単位）テンプレートファイルが存在しません。',
	'm_TE0012' => '【TE0012】車両別売上集計表（年単位）テンプレートファイルが存在しません。',
	'm_TE0013' => '【TE0013】取扱いトン数集計表（日単位）テンプレートファイルが存在しません。',
	'm_TE0014' => '【TE0014】取扱いトン数集計表（月単位）テンプレートファイルが存在しません。',
	'm_TE0015' => '【TE0015】取扱いトン数集計表（年単位）テンプレートファイルが存在しません。',
	'm_TE0016' => '【TE0016】ドライバー別売上集計表（1、3課）テンプレートファイルが存在しません。',
	'm_TE0017' => '【TE0017】ドライバー別売上集計表（2課）テンプレートファイルが存在しません。',
	'm_TE0018' => '【TE0018】ドライバー別売上集計表（輸送所）テンプレートファイルが存在しません。',
	'm_TE0019' => '【TE0019】車番案内書テンプレートファイルが存在しません。',
	'm_TE0020' => '【TE0020】売上請求予定明細書テンプレートファイルが存在しません。',
	'm_TE0021' => '【TE0021】傭車支払予定明細書テンプレートファイルが存在しません。',
    'm_TE0022' => '【TE0022】請求明細書テンプレートファイルが存在しません。',

);
