<?php
/**
 * 検索上限定義
 */

return array(
	// 配車検索（チャーター便）画面検索上限
    'd0011_limit' => 60000,
    // 月極その他情報検索画面検索上限
    'd0031_limit' => 60000,
	// 配車照会（チャーター便）画面検索上限
    'd0040_limit' => 60000,
	// 月極その他情報照会画面検索上限
    'd0060_limit' => 10000,
    // 配車情報検索画面検索上限
    's0080_limit' => 60000,
    // 月極その他情報検索画面検索上限
    's0090_limit' => 10000,
    // 配車表（チャーター便）出力上限
    'd0041_limit' => 10000,
    // 配車一覧表（チャーター便）出力上限
    'd0042_limit' => 60000,
    // 月極その他情報一覧表出力上限
    'd0061_limit' => 10000,
    // 配車検索（共配便）画面検索上限
    'd1010_limit' => 60000,
    // 配車照会（共配便）画面検索上限
    'd1040_limit' => 60000,
    // 配車情報検索（共配便）画面検索上限
    's1010_limit' => 60000,
    // 配車表（共配便）出力上限
    'd1041_limit' => 120,
    // 配車一覧表（共配便）出力上限
    'd1042_limit' => 60000,
    
    // 在庫情報検索画面検索上限
    'd1110_limit' => 60000,
    // 在庫情報照会画面検索上限
    'd1140_limit' => 60000,
    // 在庫一覧表出力上限
    'd1141_limit' => 10000,
    
    // 入出庫情報検索画面検索上限
    'd1120_limit' => 60000,
    // 入出庫情報照会画面検索上限
    'd1150_limit' => 60000,
    // 入出庫検索画面検索上限
    's1020_limit' => 60000,
    // 入出庫一覧表出力上限
    'd1151_limit' => 10000,

    // 保管料情報検索画面検索上限
    'd1130_limit' => 60000,
    // 保管料情報照会画面検索上限
    'd1160_limit' => 60000,
    // 保管料検索画面検索上限
    's1030_limit' => 60000,
    // 保管料一覧表出力上限
    'd1161_limit' => 10000,

    // 請求情報検索画面検索上限
    'b1010_limit' => 60000,
    // 請求情報雛形出力（共配便）画面検索上限
    'b1030_limit' => 60000,
    // 請求情報照会画面検索上限
    'b1040_limit' => 60000,
    // 請求情報検索（共配便）画面検索上限
    's1040_limit' => 60000,
    // 請求情報一覧表出力上限
    'b1041_limit' => 10000,
    // 納品書印刷画面検索上限
    't1120_limit' => 1000,
);